harry19902002/esp32p4-usb-music-player/sdkconfig.defaults
# 构建目标芯片
CONFIG_IDF_TARGET="esp32p4"

# 日志等级
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# USB Host 支持 HUB
CONFIG_USB_HOST_HUBS_SUPPORTED=y

# 使能实验特性 (P4 PSRAM 200M 等)
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# 使能 PSRAM (P4 需要 PSRAM 作为 USB DMA 缓冲)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# USB DWC DMA 缓冲放到 PSRAM
CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM=y

# FATFS 挂载卷数量 (最大可同时连接的 U 盘数)
CONFIG_FATFS_VOLUME_COUNT=1

# FATFS 扇区大小: U 盘标准为 512 字节 (默认 4096 会导致普通 U 盘挂载失败)
CONFIG_FATFS_SECTOR_512=y
# CONFIG_FATFS_SECTOR_4096 is not set

# FATFS 编码页: 936 简体中文 (支持中文文件名, 默认 437 英文)
CONFIG_FATFS_CODEPAGE_936=y
# CONFIG_FATFS_CODEPAGE_437 is not set

# FATFS API 编码: UTF-8 (readdir 直接返回 UTF-8 文件名, 正确支持中文)
CONFIG_FATFS_API_ENCODING_UTF_8=y
